import React from 'react';

const Exam = () => {
    const exam = [
        {
            id: 1,
            title: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است ",
            description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و ط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد ",
            media_type: "",
            media_path: "",
            variants: [
                {
                    id: 1,
                    question: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از ",
                    options: [
                        {
                            id: 1,
                            text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از "
                        }
                    ]
                }
            ],
            questionType: "multi_test"
        }
    ]
    return (
        <>

        </>
    );
};

export default Exam;