import React from 'react';
import Task from '@icons/task-square.svg'
import Chevron from "@icons/chevron-right.svg"
import Link from "next/link";
import Question from "@icons/question-circle.svg";
import {Accordion, AccordionItem, Tab, Tabs} from "@heroui/react";
import FaqQues from "@/db/faq.json";
import Plus from "@icons/plus.svg";

const Rules = () => {
    return (
        <div dir="rtl" className="container p-3 sm:p-20">
            <div className="flex flex-col items-center gap-10 my-10">
                <div className="flex gap-2 sm:self-center self-start">
                    <Link href="/" className="sm:hidden flex gap-2 items-center">
                        <Chevron className=" w-5 h-5"/>
                        <p className="text-lg">قوانین و شرایط آموزشگاه لینگومسترز</p>
                    </Link>
                    <div className="hidden sm:flex gap-2 items-center ">
                        <Task className=" w-8 h-8"/>
                        <p className="text-lg">قوانین و شرایط آموزشگاه لینگومسترز</p>
                    </div>
                </div>
                <Tabs
                    aria-label="Tabs variants"
                    variant='underlined'
                    classNames={{
                        tabList: 'border-b pb-0 gap-2 w-full',
                        cursor: "shadow-none w-full",
                        tabContent: 'lg:w-64 w-full sm:text-sm text-xs',
                        tab: "py-4 h-fit",
                        panel: 'w-full',
                        base: 'lg:w-fit w-full'
                    }}
                    style={{
                        "--heroui-success": "38 87% 56%",
                    }}
                    color='success'>
                    <Tab title='زبان آموزان' key='stu'>
                        <div className="flex flex-col gap-20">
                            <ul className="list-disc text-xs sm:text-base">
                                <p className="my-4 font-semibold">🌐 قوانین و مقررات عمومی وب‌سایت لینگومسترز</p>
                                <li>
                                    پذیرش شرایط: هرگونه استفاده از خدمات لینگومسترز به معنی پذیرفتن شرایط مندرج در سایت
                                    لینگومسترز
                                    است. سایت لینگومسترز هیچ توافقی با اساتید خارج از این شرایط ندارد.
                                </li>
                                <li>
                                    عدم مسئولیت در قبال اطلاعات: علیرغم تمام تلاش‌های تیم لینگومسترز برای راستی‌آزمایی
                                    هویت و
                                    اطلاعات ارائه شده توسط اساتید و زبان‌آموزان، لینگومسترز هیچ مسئولیت یا تعهدی در قبال
                                    اطلاعات
                                    ارائه شده توسط آن‌ها چه از طریق تماس تلفنی و چه از طریق ارسال درخواست معرفی استاد از
                                    طریق سایت
                                    ندارد.
                                </li>
                                <li>
                                    حق اصلاح یا حذف اطلاعات: لینگومسترز مختار است که هر گونه اطلاعات و عکسی که توسط
                                    اساتید به سایت
                                    ارسال می‌شود یا هر حساب کاربری و اطلاعات دیگری که مربوط به اساتید یا ایجاد شده توسط
                                    اساتید باشد
                                    را هر زمانی و به هر شکلی که ضروری بداند، اصلاح یا حذف نماید.
                                </li>
                                <li>
                                    عدم انعقاد قرارداد با اشخاص حقیقی/حقوقی در حوزه تدریس: لینگومسترز هیچ قرارداد،
                                    تعهدنامه یا سندی
                                    را با هیچ شخص حقیقی یا حقوقی در حوزه تدریس خصوصی منعقد نکرده است.
                                </li>
                                <li>
                                    عدم مسئولیت صحت اطلاعات پروفایل اساتید: علیرغم تمام تلاش‌های تیم لینگومسترز برای
                                    راستی‌آزمایی
                                    اطلاعات درج شده در پروفایل اساتید، لینگومسترز هیچ‌گونه مسئولیتی در قبال اطلاعات درج
                                    شده در
                                    پروفایل اساتید نخواهد داشت و صرفاً مطالب درج شده توسط اساتید را نمایش می‌دهد.
                                </li>
                                <li>
                                    برگزاری کلاس‌ها از طریق وب‌سایت: تعداد جلساتی که برگزار خواهند شد برابر تعداد
                                    کلاس‌های رزرو شده
                                    از وب‌سایت لینگومسترز خواهد بود.
                                </li>
                                <li>
                                    نحوه پرداخت به اساتید: لینگومسترز مختار است مبلغ حق معرفی و هماهنگی را در اسرع وقت و
                                    مطابق با
                                    دستور‌العمل‌های ابلاغی خود، از دریافتی زبان‌آموزان کسر و مابقی را بسته به شرایط،
                                    سیاست‌های کاری
                                    و تصمیم مدیریت لینگومسترز به صورت روزانه، هفتگی و یا ماهانه در وجه استاد واریز
                                    نماید.
                                </li>
                                <li>
                                    عدم مسئولیت در قبال همکاری با موسسات آموزشی: لینگومسترز هیچ قرارداد، تعهدنامه یا
                                    سندی با هیچ
                                    موسسه یا نهاد آموزشی منعقد نکرده است. لذا در صورتی که اساتید با موسسه یا نهاد آموزشی
                                    که خود را
                                    طرف قرارداد آن می‌داند، همکاری نماید، تمام مسئولیت‌ها با خود استاد مربوطه است و
                                    لینگومسترز هیچ
                                    تعهد یا مسئولیتی در قبال خسارات مستقیم، اتفاقی، تبعی، غیرمستقیم و کیفری، ناشی از
                                    ارتباط استاد با
                                    موسسه یا نهاد آموزشی مربوطه نخواهد داشت.
                                </li>
                                <li>
                                    عدم مسئولیت در قبال ارتباط حضوری: کارشناسان و سیستم سایت لینگومسترز تمام تلاش خود را
                                    برای اخذ
                                    اطلاعات کامل از زبان‌آموزان و همچنین اساتید می‌کنند و موارد امنیتی در خصوص معرفی
                                    استاد به
                                    زبان‌آموز و بالعکس را رعایت می‌نماید. با این وجود، اساتید و زبان‌آموزان با مسئولیت
                                    خود برای
                                    تدریس و یا یادگیری به محل مربوطه که می‌تواند آموزشگاه، محل کار زبان‌آموز، منزل
                                    زبان‌آموز و یا
                                    منزل استاد به توافق می‌رسند و مراجعه می‌کنند و لینگومسترز هیچ تعهد یا مسئولیتی در
                                    قبال خسارات
                                    مستقیم، اتفاقی، تبعی، غیرمستقیم و کیفری، ناشی از ارتباط بین استاد با زبان‌آموز
                                    نخواهد داشت. به
                                    عبارتی لینگومسترز صرفاً ارتباط بین استاد و زبان‌آموز را هماهنگ می‌کند و به هیچ عنوان
                                    تضمینی در
                                    مورد نیات و قصد زبان‌آموز به استاد و بالعکس نمی‌تواند ارائه نماید.
                                </li>
                                <li>
                                    امنیت پرداخت: برای امنیت خود و جلوگیری از ضرر و زیان لطفاً به هیچ وجه در خارج از
                                    سایت لینگومسترز
                                    هیچ مبلغی را به اساتید پرداخت نکنید. پرداخت از طریق لینگومسترز تنها روش تضمین
                                    جلوگیری از بدقولی،
                                    کیفیت کلاس‌ها و جلوگیری از سوء استفاده‌های احتمالی می‌باشد. لینگومسترز پس از اطمینان
                                    از تشکیل
                                    کلاس‌ها، پس از کسر هزینه معرفی و کارمزد مبلغ را در وجه استاد واریز خواهد کرد.
                                </li>
                                <li>
                                    حق عدم پذیرش درخواست: در صورت مشاهده تخلف یا تلاش برای سوءاستفاده از تضمین درستی
                                    رزومه‌ها، حق
                                    عدم پذیرش آن درخواست برای لینگومسترز محفوظ است. لینگومسترز می‌تواند در هر زمان به
                                    تشخیص خود
                                    شرایط تضمین‌ها را تغییر داده یا ارائه آن را متوقف کند. در موارد اختلاف، مدیریت
                                    لینگومسترز تصمیم
                                    گیرنده نهایی خواهد بود.
                                </li>
                                <li>
                                    مدت زمان کلاس: مدت زمان هر کلاس بیست و پنج دقیقه است. چنانچه زبان‌آموز دو یا چند
                                    جلسه را به طور
                                    متوالی رزرو کرده باشد، استاد یا زبان‌آموز یا هر دو می‌توانند پنج دقیقه به ازای هر
                                    کلاس تدریس شده
                                    استراحت داشته باشند و بلافاصله رأس ساعت کلاس بعدی حاضر شوند، یا در صورت تمایل بدون
                                    استراحت به
                                    ازای هر کلاس رزرو شده بیست و پنج دقیقه و در مجموع پنجاه، هفتاد و پنج دقیقه و... در
                                    کلاس حضور
                                    داشته باشند.
                                </li>
                                <li>
                                    اطلاع‌رسانی پیشامدهای ناخواسته: چه استاد و چه زبان‌آموز، هر دو طرف در صورت بروز
                                    هرگونه پیشامد
                                    ناخواسته که منجر به عدم حضور رأس ساعت کلاسی شود، بایستی در اسرع وقت موضوع را به
                                    لینگومسترز اطلاع
                                    دهند.
                                </li>
                                <p className="my-4 font-semibold">👨‍🎓 قوانین مربوط به زبان‌آموزان</p>
                                <li>
                                    ثبت‌نام صحیح: زبان‌آموز موظف است اطلاعات حقیقی و دقیق (نام، سن، ایمیل، سطح زبان
                                    و...) در زمان
                                    ثبت‌نام ارائه دهد.
                                </li>
                                <li>
                                    رعایت اخلاق و ادب: احترام به اساتید، سایر زبان‌آموزان و قوانین کلاس‌ها الزامی است.
                                </li>
                                <li>
                                    عدم ضبط و پخش: ضبط، انتشار یا بازنشر کلاس‌ها و فایل‌های آموزشی بدون مجوز مکتوب ممنوع
                                    است.
                                </li>
                                <li>
                                    پرداخت شهریه: پرداخت شهریه فقط از طریق سایت معتبر است و هرگونه پرداخت مستقیم به
                                    استاد غیرمجاز و
                                    تخلف است.
                                </li>
                                <li>
                                    گزارش تخلف: در صورت مشاهده تخلف یا رفتار نامناسب از سوی استاد یا کاربر دیگر،
                                    زبان‌آموز می‌تواند
                                    از طریق بخش پشتیبانی گزارش دهد.
                                </li>
                                <li>
                                    تمدید کلاس‌ها: تمدید کلاس‌ها فقط و فقط باید از طریق سایت انجام شود. در غیر این‌صورت،
                                    لینگومسترز
                                    حق قطع دسترسی یا ارائه خدمات به زبان‌آموز را دارد.
                                </li>
                                <li>
                                    گزارش پیشنهاد کلاس خارج از سایت: در صورت پیشنهاد کلاس خارج از سایت توسط استاد،
                                    زبان‌آموز موظف به
                                    اطلاع‌رسانی فوری به لینگومسترز است.
                                </li>
                                <li>
                                    پیگیری تدریس دروس جدید: در صورت خرید و درخواست تدریس دروسی غیر از کلاس‌های رزرو شده،
                                    زبان‌آموز
                                    باید این موضوع را از طریق لینگومسترز انجام دهد و نه استاد.
                                </li>
                                <li>
                                    اطلاعات هویتی برای کلاس حضوری: برای کلاس حضوری، زبان‌آموز باید اطلاعات هویتی کامل
                                    شامل تصویر
                                    کارت ملی، آدرس، تلفن و... را در سایت ثبت کند.
                                </li>
                                <li>
                                    حضور به موقع در کلاس: اگر زبان‌آموز پس از 3 دقیقه اول کلاس حاضر نشود، استاد باید به
                                    پشتیبان
                                    اطلاع دهد و تا پایان کلاس منتظر بماند و مبلغ کامل کلاس به استاد تعلق می‌گیرد.
                                </li>
                                <li>
                                    گزارش سوءاستفاده: در صورت مشاهده سوءاستفاده، تماس یا پرداخت خارج از لینگومسترز،
                                    زبان‌آموز باید
                                    به پشتیبانی اطلاع دهد.
                                </li>
                                <li>
                                    کلاس‌های خصوصی: در کلاس‌های خصوصی فقط یک زبان‌آموز باید حضور داشته باشد. هیچ شخص
                                    دیگری نباید از
                                    کلاس استفاده کند، مگر والدین برای نظارت. چنانچه زوجی، خواهر و برادری، زن و شوهری
                                    و... بخواهند از
                                    کلاس استفاده کنند، زبان‌آموزان نیز موظف هستند تا درخواست تعریف کلاس گروهی اختصاصی و
                                    ثبت در
                                    لینگومسترز را بدهند. استاد موظف است کلاس گروهی مرتبط را برای روزها و ساعاتی که
                                    زبان‌آموزان
                                    می‌خواهند، در لینگومسترز ثبت نماید.
                                </li>
                                <p className="my-4 font-semibold">🛑 قوانین لغو کلاس‌های گروهی، وبینار و ورکشاپ</p>
                                <li>
                                    ✅ لغو این نوع کلاس‌ها تنها در صورتی مجاز است که بیش از ۲۴ ساعت تا شروع کلاس باقی
                                    مانده باشد. در
                                    این صورت، کل مبلغ پرداختی بدون هیچ‌گونه جریمه‌ای به اعتبار زبان‌آموز بازگردانده
                                    می‌شود.
                                </li>
                                <li>
                                    ❌ در صورتی که کمتر از ۲۴ ساعت تا شروع کلاس باقی مانده باشد، امکان لغو کلاس وجود
                                    ندارد و هیچ‌گونه
                                    وجهی قابل استرداد نیست.
                                </li>
                                <p className="my-4 font-semibold">🛑 قوانین لغو کلاس‌های خصوصی توسط زبان‌آموز</p>
                                <li>
                                    لغو اضطراری کلاس توسط استاد یا زبان‌آموز در صورتی که با ارائه گواهی مستند مانند
                                    گواهی پزشکی و...
                                    باشد، بدون هیچ‌گونه جریمه‌ای خواهد بود. لغو کلاس توسط استاد یا زبان‌آموز در صورتی که
                                    بیش از 24
                                    ساعت به شروع کلاس مانده باشد، بدون هیچ‌گونه جریمه خواهد بود و در این حالت اعتبار
                                    زبان‌آموز به
                                    اندازه مبلغ کلاس لغو شده افزایش می‌یابد و زبان‌آموز می‌تواند هر زمانی که بخواهد با
                                    همان استاد و
                                    یا استاد دیگری کلاس دیگری را رزرو کند. در صورتی که کمتر از 24 ساعت به شروع کلاس
                                    مانده باشد،
                                    میزان جریمه‌ها طبق جدول زیر محاسبه و در اعتبار مالی مربوطه اعمال خواهد شد. در صورتی
                                    که لغو کلاس
                                    از طرف استاد باشد، کل مبلغ کلاس به اعتبار زبان‌آموز اضافه می‌گردد و زبان‌آموز در
                                    اسرع وقت از لغو
                                    کلاس مطلع خواهد شد.
                                </li>
                                <p className="my-4 font-semibold">🚫 قانون همکاری خارج از پلتفرم (خط قرمز لینگومسترز)</p>
                                <li>
                                    هرگونه برگزاری کلاس، تمدید همکاری یا ایجاد ارتباط آموزشی بین استاد و زبان‌آموز خارج
                                    از بستر رسمی
                                    وب‌سایت لینگومسترز، به هر شکل و با هر نیتی، تخلف جدی محسوب می‌شود.
                                </li>
                                <p className="my-4 font-semibold">🔴 این عمل، خط قرمز لینگومسترز است و در صورت
                                    مشاهده:</p>
                                <li>
                                    ✅ همکاری استاد به‌ صورت دائمی قطع خواهد شد.
                                </li>
                                <li>
                                    ✅ تمام اعتبار مالی باقی‌مانده در سایت باطل می‌گردد.
                                </li>
                                <li>
                                    ✅ پروفایل‌ها و دسترسی‌ها بدون هشدار قبلی مسدود خواهند شد.
                                </li>
                                <li>
                                    ✅ ارائه خدمات به زبان‌آموز به‌صورت کامل و دائمی متوقف می‌شود.
                                </li>
                                <li>
                                    ⚠️ این قانون به منظور حفظ امنیت مالی، کیفیت آموزشی و جلوگیری از سواستفاده و نقض حقوق
                                    طرفین
                                    (استاد، زبان‌آموز و پلتفرم) به‌صورت جدی و بدون استثنا اجرا خواهد شد.
                                </li>
                            </ul>
                            <div className="overflow-x-auto">
                                <table
                                    className="min-w-full table-auto border-collapse border border-natural_gray-400 bg-natural_gray-50 lg:text-base">
                                    <thead>
                                    <tr>
                                        <th colSpan="2"
                                            className="border border-natural_gray-400 py-4 text-center text-natural_gray-950 bg-natural_gray-50 text-xs sm:text-base ">
                                            لغو کلاس
                                        </th>
                                    </tr>
                                    <tr className="[&>th]:border [&>th]:border-natural_gray-400 [&>th]:py-4 [&>th]:text-center bg-natural_gray-50">
                                        <th className="text-xs sm:text-base">مدت زمان باقی مانده تا شروع کلاس</th>
                                        <th className="text-xs sm:text-base">میزان جریمه (درصد از مبلغ کلاس)</th>
                                    </tr>
                                    <tr className="[&>th]:border [&>th]:border-natural_gray-400 [&>th]:py-4 [&>th]:text-center bg-natural_gray-50">
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base ">پس
                                            از شروع
                                            کلاس (غیبت کامل)
                                        </th>
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">100%
                                            مبلغ کلاس
                                        </th>
                                    </tr>
                                    <tr className="[&>th]:border [&>th]:border-natural_gray-400 [&>th]:py-4 [&>th]:text-center bg-natural_gray-50">
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">کمتر
                                            از 3 ساعت
                                            قبل از شروع کلاس
                                        </th>
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">80%
                                            مبلغ کلاس
                                        </th>
                                    </tr>
                                    <tr className="[&>th]:border [&>th]:border-natural_gray-400 [&>th]:py-4 [&>th]:text-center bg-natural_gray-50">
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">کمتر
                                            از 6 ساعت
                                            تا 3 ساعت قبل از شروع کلاس
                                        </th>
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">60%
                                            مبلغ کلاس
                                        </th>
                                    </tr>
                                    <tr className="[&>th]:border [&>th]:border-natural_gray-400 [&>th]:py-4 [&>th]:text-center bg-natural_gray-50">
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">کمتر
                                            از 12 ساعت
                                            تا 6 ساعت قبل از شروع کلاس
                                        </th>
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">40%
                                            مبلغ کلاس
                                        </th>
                                    </tr>
                                    <tr className="[&>th]:border [&>th]:border-natural_gray-400 [&>th]:py-4 [&>th]:text-center bg-natural_gray-50">
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">کمتر
                                            از 24 ساعت
                                            تا 12 ساعت قبل از شروع کلاس
                                        </th>
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">20%
                                            مبلغ کلاس
                                        </th>
                                    </tr>
                                    <tr className="[&>th]:border [&>th]:border-natural_gray-400 [&>th]:py-4 [&>th]:text-center bg-natural_gray-50">
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">بیش
                                            از 24 ساعت
                                            قبل از شروع کلاس
                                        </th>
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">بدون
                                            جریمه
                                        </th>
                                    </tr>
                                    </thead>
                                </table>
                            </div>
                        </div>
                    </Tab>
                    <Tab title='اساتید' key='pro'>
                        <div className="flex flex-col gap-20">
                            <ul className="list-disc text-xs sm:text-base">
                                <p className="my-4 font-semibold">🌐 قوانین و مقررات عمومی وب‌سایت لینگومسترز</p>
                                <li>
                                    پذیرش شرایط: هرگونه استفاده از خدمات لینگومسترز به معنی پذیرفتن شرایط مندرج در سایت
                                    لینگومسترز
                                    است. سایت لینگومسترز هیچ توافقی با اساتید خارج از این شرایط ندارد.
                                </li>
                                <li>
                                    عدم مسئولیت در قبال اطلاعات: علیرغم تمام تلاش‌های تیم لینگومسترز برای راستی‌آزمایی
                                    هویت و
                                    اطلاعات ارائه شده توسط اساتید و زبان‌آموزان، لینگومسترز هیچ مسئولیت یا تعهدی در قبال
                                    اطلاعات
                                    ارائه شده توسط آن‌ها چه از طریق تماس تلفنی و چه از طریق ارسال درخواست معرفی استاد از
                                    طریق سایت
                                    ندارد.
                                </li>
                                <li>
                                    حق اصلاح یا حذف اطلاعات: لینگومسترز مختار است که هر گونه اطلاعات و عکسی که توسط
                                    اساتید به سایت
                                    ارسال می‌شود یا هر حساب کاربری و اطلاعات دیگری که مربوط به اساتید یا ایجاد شده توسط
                                    اساتید باشد
                                    را هر زمانی و به هر شکلی که ضروری بداند، اصلاح یا حذف نماید.
                                </li>
                                <li>
                                    عدم انعقاد قرارداد با اشخاص حقیقی/حقوقی در حوزه تدریس: لینگومسترز هیچ قرارداد،
                                    تعهدنامه یا سندی
                                    را با هیچ شخص حقیقی یا حقوقی در حوزه تدریس خصوصی منعقد نکرده است.
                                </li>
                                <li>
                                    عدم مسئولیت صحت اطلاعات پروفایل اساتید: علیرغم تمام تلاش‌های تیم لینگومسترز برای
                                    راستی‌آزمایی
                                    اطلاعات درج شده در پروفایل اساتید، لینگومسترز هیچ‌گونه مسئولیتی در قبال اطلاعات درج
                                    شده در
                                    پروفایل اساتید نخواهد داشت و صرفاً مطالب درج شده توسط اساتید را نمایش می‌دهد.
                                </li>
                                <li>
                                    برگزاری کلاس‌ها از طریق وب‌سایت: تعداد جلساتی که برگزار خواهند شد برابر تعداد
                                    کلاس‌های رزرو شده
                                    از وب‌سایت لینگومسترز خواهد بود.
                                </li>
                                <li>
                                    نحوه پرداخت به اساتید: لینگومسترز مختار است مبلغ حق معرفی و هماهنگی را در اسرع وقت و
                                    مطابق با
                                    دستور‌العمل‌های ابلاغی خود، از دریافتی زبان‌آموزان کسر و مابقی را بسته به شرایط،
                                    سیاست‌های کاری
                                    و تصمیم مدیریت لینگومسترز به صورت روزانه، هفتگی و یا ماهانه در وجه استاد واریز
                                    نماید.
                                </li>
                                <li>
                                    عدم مسئولیت در قبال همکاری با موسسات آموزشی: لینگومسترز هیچ قرارداد، تعهدنامه یا
                                    سندی با هیچ
                                    موسسه یا نهاد آموزشی منعقد نکرده است. لذا در صورتی که اساتید با موسسه یا نهاد آموزشی
                                    که خود را
                                    طرف قرارداد آن می‌داند، همکاری نماید، تمام مسئولیت‌ها با خود استاد مربوطه است و
                                    لینگومسترز هیچ
                                    تعهد یا مسئولیتی در قبال خسارات مستقیم، اتفاقی، تبعی، غیرمستقیم و کیفری، ناشی از
                                    ارتباط استاد با
                                    موسسه یا نهاد آموزشی مربوطه نخواهد داشت.
                                </li>
                                <li>
                                    عدم مسئولیت در قبال ارتباط حضوری: کارشناسان و سیستم سایت لینگومسترز تمام تلاش خود را
                                    برای اخذ
                                    اطلاعات کامل از زبان‌آموزان و همچنین اساتید می‌کنند و موارد امنیتی در خصوص معرفی
                                    استاد به
                                    زبان‌آموز و بالعکس را رعایت می‌نماید. با این وجود، اساتید و زبان‌آموزان با مسئولیت
                                    خود برای
                                    تدریس و یا یادگیری به محل مربوطه که می‌تواند آموزشگاه، محل کار زبان‌آموز، منزل
                                    زبان‌آموز و یا
                                    منزل استاد به توافق می‌رسند و مراجعه می‌کنند و لینگومسترز هیچ تعهد یا مسئولیتی در
                                    قبال خسارات
                                    مستقیم، اتفاقی، تبعی، غیرمستقیم و کیفری، ناشی از ارتباط بین استاد با زبان‌آموز
                                    نخواهد داشت. به
                                    عبارتی لینگومسترز صرفاً ارتباط بین استاد و زبان‌آموز را هماهنگ می‌کند و به هیچ عنوان
                                    تضمینی در
                                    مورد نیات و قصد زبان‌آموز به استاد و بالعکس نمی‌تواند ارائه نماید.
                                </li>
                                <li>
                                    امنیت پرداخت: برای امنیت خود و جلوگیری از ضرر و زیان لطفاً به هیچ وجه در خارج از
                                    سایت لینگومسترز
                                    هیچ مبلغی را به اساتید پرداخت نکنید. پرداخت از طریق لینگومسترز تنها روش تضمین
                                    جلوگیری از بدقولی،
                                    کیفیت کلاس‌ها و جلوگیری از سوء استفاده‌های احتمالی می‌باشد. لینگومسترز پس از اطمینان
                                    از تشکیل
                                    کلاس‌ها، پس از کسر هزینه معرفی و کارمزد مبلغ را در وجه استاد واریز خواهد کرد.
                                </li>
                                <li>
                                    حق عدم پذیرش درخواست: در صورت مشاهده تخلف یا تلاش برای سوءاستفاده از تضمین درستی
                                    رزومه‌ها، حق
                                    عدم پذیرش آن درخواست برای لینگومسترز محفوظ است. لینگومسترز می‌تواند در هر زمان به
                                    تشخیص خود
                                    شرایط تضمین‌ها را تغییر داده یا ارائه آن را متوقف کند. در موارد اختلاف، مدیریت
                                    لینگومسترز تصمیم
                                    گیرنده نهایی خواهد بود.
                                </li>
                                <li>
                                    مدت زمان کلاس: مدت زمان هر کلاس بیست و پنج دقیقه است. چنانچه زبان‌آموز دو یا چند
                                    جلسه را به طور
                                    متوالی رزرو کرده باشد، استاد یا زبان‌آموز یا هر دو می‌توانند پنج دقیقه به ازای هر
                                    کلاس تدریس شده
                                    استراحت داشته باشند و بلافاصله رأس ساعت کلاس بعدی حاضر شوند، یا در صورت تمایل بدون
                                    استراحت به
                                    ازای هر کلاس رزرو شده بیست و پنج دقیقه و در مجموع پنجاه، هفتاد و پنج دقیقه و... در
                                    کلاس حضور
                                    داشته باشند.
                                </li>
                                <li>
                                    اطلاع‌رسانی پیشامدهای ناخواسته: چه استاد و چه زبان‌آموز، هر دو طرف در صورت بروز
                                    هرگونه پیشامد
                                    ناخواسته که منجر به عدم حضور رأس ساعت کلاسی شود، بایستی در اسرع وقت موضوع را به
                                    لینگومسترز اطلاع
                                    دهند.
                                </li>
                                <p className="my-4 font-semibold">👩‍🏫 قوانین مربوط به اساتید</p>
                                <li>
                                    احراز هویت: ثبت‌نام و ارائه مدارک هویتی، تحصیلی و سوابق کاری (شامل تصویر کارت ملی،
                                    آدرس، تلفن، مدارک تحصیلی و عکس) برای تایید حساب استاد ضروری است و باید تأیید
                                    پشتیبانی را دریافت کند.
                                </li>
                                <li>
                                    برگزاری منظم کلاس‌ها: استاد موظف است کلاس‌ها را در زمان تعیین‌شده برگزار نماید.
                                </li>
                                <li>
                                    رعایت حریم خصوصی زبان‌آموزان: ضبط، ذخیره یا به اشتراک‌گذاری اطلاعات زبان‌آموزان بدون
                                    اجازه ممنوع است.
                                </li>
                                <li>
                                    شفافیت در قیمت‌گذاری: اساتید باید نرخ خدمات خود را شفاف اعلام کنند و از دریافت وجه
                                    خارج از پلتفرم خودداری نمایند.
                                </li>
                                <li>
                                    کلاس‌های خصوصی: در کلاس‌های خصوصی فقط یک زبان‌آموز باید حضور داشته باشد. هیچ شخص
                                    دیگری نباید از کلاس استفاده کند، مگر والدین برای نظارت. چنانچه زوجی، خواهر و برادری،
                                    زن و شوهری و... بخواهند از کلاس استفاده کنند، استاد موظف است کلاس گروهی برای روزها و
                                    ساعاتی که زبان‌آموزان می‌خواهند ثبت کند و زبان‌آموزان نیز موظف هستند در کلاس گروهی
                                    اختصاصی که استاد برای آن افراد تعریف می‌کند ثبت نام نمایند.
                                </li>
                                <li>
                                    رزرو کلاس‌ها: تمامی کلاس‌ها باید از طریق وب‌سایت رزرو شده باشند. اگر استادی چه به
                                    صورت سرخود و چه با تبانی با زبان‌آموز سعی در برگزاری کلاس بدون رزرو در وب‌سایت
                                    لینگومسترز نماید تا از پرداخت هزینه به لینگومسترز خودداری کند، لینگومسترز این حق را
                                    برای خود محفوظ می‌داند که نسبت به هرگونه عملی در خصوص پروفایل، سابقه همکاری و اعتبار
                                    مالی و قطع همکاری با اساتید و زبان‌آموزان در سایت اقدام نماید.
                                </li>
                                <li>
                                    عدم پیشنهاد همکاری خارج از سایت: در صورتی که زبان‌آموزی پس از خرید و رزرو تعداد
                                    جلسات مشخص شده نسبت به تمدید کلاس‌ها، در خارج از وب‌سایت اقدام نماید، استاد موظف است
                                    این موضوع را به اطلاع لینگومسترز برساند. حتی در صورتی که زبان‌آموز پس از مدت زمانی
                                    وقفه اقدام به تمدید کلاس نماید، استاد موظف است که لینگومسترز را در جریان تمدید
                                    کلاس‌ها قرار دهد. در صورتی که استاد به هر دلیلی تمدید کلاس را به لینگومسترز اطلاع
                                    ندهد، لینگومسترز این حق را برای خود محفوظ می‌داند که نسبت به هرگونه عملی در خصوص
                                    پروفایل، سابقه همکاری و اعتبار مالی اساتید در سایت اقدام نماید.
                                </li>
                                <li>
                                    هماهنگی برای تدریس دروس دیگر: در صورتی که زبان‌آموز از استاد مربوطه بخواهد که دروس
                                    دیگری را که خریداری نشده‌اند را نیز به زبان‌آموز تدریس کند، استاد موظف است این کار
                                    را با کسب اجازه از لینگومسترز و اطلاع‌رسانی به سایت لینگومسترز انجام دهد. در صورتی
                                    که استاد به هر دلیل اطلاع‌رسانی نکند، لینگومسترز این حق را برای خود محفوظ می‌داند که
                                    نسبت به هرگونه عملی در خصوص پروفایل، سابقه همکاری و اعتبار مالی اساتید در سایت اقدام
                                    نماید.
                                </li>
                                <li>
                                    پایبندی به تعهدات: اکیداً لازم و ضروری است که استاد در خصوص تعهدات خود نسبت به
                                    زبان‌آموز پایبند باشد. تماس سریع با زبان‌آموز در زمان معرفی، پاسخ‌گویی به تماس‌های
                                    زبان‌آموز پیش از جلسه اول و پس از آن، عدم دریافت هیچ‌گونه وجه اضافی به هر میزان و
                                    نحوی و سایر توافقات از جمله تعهدات استاد نسبت به زبان‌آموز می‌باشد.
                                </li>
                                <li>
                                    کلاس‌های حضوری خصوصی داخل ایران: تنها زبان‌آموزان خانم، می‌توانند از خدمات برای
                                    کلاس‌های حضوری اساتید خانم لینگومسترز استفاده نمایند. به عبارتی در صورتی که فردی که
                                    درخواست را ثبت می‌کند، آقا باشد، امکان رزرو استاد حضوری خصوصی خانم در داخل ایران
                                    برایش مقدور نمی‌باشد.
                                </li>
                                <li>
                                    حضور به موقع در کلاس: اگر استاد تا 5 دقیقه اول سر کلاس حاضر نشود، کلاس لغو شده و
                                    مبلغ کامل به زبان‌آموز بازگردانده می‌شود.
                                </li>
                                <li>
                                    تکرار غیبت: در صورت تکرار غیبت، لینگومسترز حق اعمال جریمه یا قطع همکاری را دارد.
                                </li>
                                <p className="my-4 font-semibold">🛑 قوانین لغو کلاس‌های گروهی، وبینار و ورکشاپ</p>
                                <li>
                                    ✅ لغو این نوع کلاس‌ها تنها در صورتی مجاز است که بیش از ۲۴ ساعت تا شروع کلاس باقی
                                    مانده باشد. در
                                    این صورت، کل مبلغ پرداختی بدون هیچ‌گونه جریمه‌ای به اعتبار زبان‌آموز بازگردانده
                                    می‌شود.
                                </li>
                                <li>
                                    ❌ در صورتی که کمتر از ۲۴ ساعت تا شروع کلاس باقی مانده باشد، امکان لغو کلاس وجود
                                    ندارد و هیچ‌گونه
                                    وجهی قابل استرداد نیست.
                                </li>
                                <p className="my-4 font-semibold">🛑 قوانین لغو کلاس‌های خصوصی توسط اساتید</p>
                                <li>
                                    لغو اضطراری کلاس توسط استاد یا زبان‌آموز در صورتی که با ارائه گواهی مستند مانند
                                    گواهی پزشکی و... باشد، بدون هیچ‌گونه جریمه‌ای خواهد بود. لغو کلاس توسط استاد یا
                                    زبان‌آموز در صورتی که بیش از 24 ساعت به شروع کلاس مانده باشد، بدون هیچ‌گونه جریمه
                                    خواهد بود و در این حالت اعتبار زبان‌آموز به اندازه مبلغ کلاس لغو شده افزایش می‌یابد
                                    و زبان‌آموز می‌تواند هر زمانی که بخواهد با همان استاد و یا استاد دیگری کلاس دیگری را
                                    رزرو کند.
                                </li>
                                <li>
                                    در صورتی که کمتر از 24 ساعت به شروع کلاس مانده باشد، میزان جریمه‌ها طبق جدول زیر
                                    محاسبه و در اعتبار مالی مربوطه اعمال خواهد شد. در صورتی که لغو کلاس از طرف استاد
                                    باشد، کل مبلغ کلاس به اعتبار زبان‌آموز اضافه می‌گردد و زبان‌آموز در اسرع وقت از لغو
                                    کلاس مطلع خواهد شد.
                                </li>
                                <p className="my-4 font-semibold">💰 نحوه اعمال جریمه و واریز مبالغ</p>
                                <li>
                                    ✅ در صورتی که کلاس توسط استاد لغو شود، جریمه تعیین‌ شده به طور کامل در وجه
                                    لینگومسترز واریز خواهد شد و به زبان‌آموز تمام مبلغ کلاس بازگردانده می‌شود.
                                </li>
                                <li>
                                    ✅ در صورتی که کلاس توسط زبان‌آموز لغو شود:
                                </li>
                                <li>
                                    ۲۵٪ از مبلغ جریمه به عنوان کارمزد به لینگومسترز تعلق می‌گیرد.
                                </li>
                                <li>
                                    ۷۵٪ باقی‌مانده از مبلغ جریمه به استاد پرداخت خواهد شد.
                                </li>
                                <p className="my-4 font-semibold">🚫 قانون همکاری خارج از پلتفرم (خط قرمز لینگومسترز)</p>
                                <li>
                                    هرگونه برگزاری کلاس، تمدید همکاری یا ایجاد ارتباط آموزشی بین استاد و زبان‌آموز خارج
                                    از بستر رسمی وب‌سایت لینگومسترز، به هر شکل و با هر نیتی، تخلف جدی محسوب می‌شود.
                                </li>
                                <p className="my-4 font-semibold">🔴 این عمل، خط قرمز لینگومسترز است و در صورت
                                    مشاهده:</p>
                                <li>
                                    ✅ همکاری استاد به‌ صورت دائمی قطع خواهد شد.
                                </li>
                                <li>
                                    ✅ تمام اعتبار مالی باقی‌مانده در سایت باطل می‌گردد.
                                </li>
                                <li>
                                    ✅ پروفایل‌ها و دسترسی‌ها بدون هشدار قبلی مسدود خواهند شد.
                                </li>
                                <li>
                                    ✅ ارائه خدمات به زبان‌آموز به‌صورت کامل و دائمی متوقف می‌شود.
                                </li>
                                <li>
                                    ⚠️ ا‌ین قانون به منظور حفظ امنیت مالی، کیفیت آموزشی و جلوگیری از سواستفاده و نقض
                                    حقوق طرفین (استاد، زبان‌آموز و پلتفرم) به‌‌ صورت جدی و بدون استثنا اجرا خواهد شد.
                                </li>
                                <p className="my-4 font-semibold">📝 الزام تهیه پلن توسط اساتید</p>
                                <li>
                                    اساتید موظف‌اند برای هر یک از زبان‌هایی که تدریس می‌کنند، پلن‌های آموزشی مجزا (برای
                                    کلاس‌های خصوصی، گروهی، وبینار یا ورکشاپ) تهیه و در پروفایل خود ثبت نمایند
                                </li>
                                <p className="my-4 font-semibold">🔹 کارمزد پلتفرم لینگومسترز</p>
                                <li>
                                    کارمزد دریافتی لینگومسترز به شرح زیر است:
                                </li>
                                <li>
                                    🟢 ۲۵٪ از مبلغ کلاس‌های خصوصی
                                </li>
                                <li>
                                    🟣 ۳۵٪ از مبلغ کلاس‌های گروهی، وبینارها و ورکشاپ‌ها
                                </li>
                                <li>
                                    ✅ این کارمزدها پیش از پرداخت به اساتید، از مبلغ کل هر کلاس کسر می‌گردد.
                                </li>
                                <p className="my-4 font-semibold">💰 زمان‌بندی پرداخت‌ها به اساتید</p>
                                <li>
                                    📅 پرداخت حق‌الزحمه اساتید بابت کلاس‌های برگزارشده و پایان‌یافته، پس از کسر کارمزد و
                                    جریمه های تأخیر یا غیبت، به صورت ماهانه و در تاریخ پنجم هر ماه انجام می‌شود.
                                </li>
                                <li>
                                    📌 در صورتی که این تاریخ با تعطیلات رسمی مصادف باشد، پرداخت به اولین روز کاری پس از
                                    تعطیلات موکول خواهد شد.
                                </li>
                            </ul>
                            <div className="overflow-x-auto">
                                <table
                                    className="min-w-full table-auto border-collapse border border-natural_gray-400 bg-natural_gray-50 lg:text-base">
                                    <thead>
                                    <tr>
                                        <th colSpan="2"
                                            className="border border-natural_gray-400 py-4 text-center text-natural_gray-950 bg-natural_gray-50 text-xs sm:text-base ">
                                            لغو کلاس
                                        </th>
                                    </tr>
                                    <tr className="[&>th]:border [&>th]:border-natural_gray-400 [&>th]:py-4 [&>th]:text-center bg-natural_gray-50">
                                        <th className="text-xs sm:text-base">مدت زمان باقی مانده تا شروع کلاس</th>
                                        <th className="text-xs sm:text-base">میزان جریمه (درصد از مبلغ کلاس)</th>
                                    </tr>
                                    <tr className="[&>th]:border [&>th]:border-natural_gray-400 [&>th]:py-4 [&>th]:text-center bg-natural_gray-50">
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base ">پس
                                            از شروع
                                            کلاس (غیبت کامل)
                                        </th>
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">100%
                                            مبلغ کلاس
                                        </th>
                                    </tr>
                                    <tr className="[&>th]:border [&>th]:border-natural_gray-400 [&>th]:py-4 [&>th]:text-center bg-natural_gray-50">
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">کمتر
                                            از 3 ساعت
                                            قبل از شروع کلاس
                                        </th>
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">80%
                                            مبلغ کلاس
                                        </th>
                                    </tr>
                                    <tr className="[&>th]:border [&>th]:border-natural_gray-400 [&>th]:py-4 [&>th]:text-center bg-natural_gray-50">
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">کمتر
                                            از 6 ساعت
                                            تا 3 ساعت قبل از شروع کلاس
                                        </th>
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">60%
                                            مبلغ کلاس
                                        </th>
                                    </tr>
                                    <tr className="[&>th]:border [&>th]:border-natural_gray-400 [&>th]:py-4 [&>th]:text-center bg-natural_gray-50">
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">کمتر
                                            از 12 ساعت
                                            تا 6 ساعت قبل از شروع کلاس
                                        </th>
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">40%
                                            مبلغ کلاس
                                        </th>
                                    </tr>
                                    <tr className="[&>th]:border [&>th]:border-natural_gray-400 [&>th]:py-4 [&>th]:text-center bg-natural_gray-50">
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">کمتر
                                            از 24 ساعت
                                            تا 12 ساعت قبل از شروع کلاس
                                        </th>
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">20%
                                            مبلغ کلاس
                                        </th>
                                    </tr>
                                    <tr className="[&>th]:border [&>th]:border-natural_gray-400 [&>th]:py-4 [&>th]:text-center bg-natural_gray-50">
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">بیش
                                            از 24 ساعت
                                            قبل از شروع کلاس
                                        </th>
                                        <th className="text-natural_gray-950 font-semibold text-[10px] sm:text-base">بدون
                                            جریمه
                                        </th>
                                    </tr>
                                    </thead>
                                </table>
                            </div>
                        </div>
                    </Tab>
                </Tabs>
            </div>
        </div>
    );
};

export default Rules;